app/Controllers/AuthController.php

    public function authenticateUser($email, $userpassword)
    {
        //verifying if user exists in the database
        $userInfo =$this->users->where('email',$email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'devjaja@gmail.com'
 LIMIT 1